{
    "data": {
        "temp_limit": 3.6,
        "factors":[
            {   "order_num": 1, 
                "legend_label": "Coal Power Plants", 
                "title": "Coal Power Plants", 
                "color": "#b720dd", 
                "policy": "usual",
                "icon_class": "coal",
                "factor_description": "Generating electricity from coal emits billions of tons of carbon dioxide, and a lot of energy is wasted in the process of transmission from large centralized power plants to homes and industries. Nearly 80% of electricity generated globally comes from coal, which produces more carbon dioxide than burning natural gas or oil.",
                "business_as_usual_text": "Our reliance on coal increases by ten times by the end of the century, especially because oil and natural gas become more expensive as resources run out.",
                "policy_text": "There is increased efficiency of existing power plants and switching to cleaner fuel options. Carbon capture sequestration and storage (CCS) technologies also drive down emissions. Homes and factories generate electricity through solar panels and other renewable sources."
            },
            {   "order_num": 2, 
                "legend_label": "Natural Gas", 
                "title": "Natural Gas", 
                "color": "#f6705a", 
                "policy": "usual",
                "icon_class": "gas",
                "factor_description": "Natural gas produces less carbon dioxide than coal. However, natural gas is mostly comprised of the greenhouse gas methane, and the entire natural gas supply chain leaks methane into the atmosphere.",
                "business_as_usual_text": "Natural gas is relied on heavily for energy, and new leaks arise as more natural gas plants are developed.",
                "policy_text": "Methane leaks in pipes and other infrastructure are plugged. There is increased efficiency of existing plants and switching to cleaner fuel options."
            },
            {   "order_num": 3, 
                "legend_label": "Waste", 
                "title": "Waste", 
                "color": "#f89b2d", 
                "policy": "usual",
                "icon_class": "waste",
                "factor_description": "Landfills emit methane as the by-product of decomposition of solid waste, and wastewater treatment plants require energy.",
                "business_as_usual_text": "Waste piles up as the population and economy grows.",
                "policy_text": "There are well established, low-cost methods to reduce greenhouse gases from consumer waste, including recycling programs, waste reduction programs, and landfill methane capture programs."
            },
            {   "order_num": 4, 
                "legend_label": "Farming", 
                "title": "Farming", 
                "color": "#fbcb0a", 
                "policy": "usual",
                "icon_class": "farming",
                "factor_description": "Many agricultural activities emit the greenhouse gases methane and nitrous oxide. Emissions come from livestock such as cows, agricultural soils, fertilizer use, and rice production.",
                "business_as_usual_text": "Increased agricultural production occurs as a response to higher food demand from increased populations. More livestock and rice production emits methane, and increased fertilizer use emits nitrous oxide.",
                "policy_text": "More efficient farming practices, better irrigation, and improved plant strains produce fewer emissions. Diets that favor plants and reduce consumption of meat and animal products lower emissions, improve health, and cost less. People buy and produce local foods."
            },
            {   "order_num": 5, 
                "legend_label": "Factories", 
                "title": "Factories", 
                "color": "#91d957", 
                "policy": "usual",
                "icon_class": "factories",
                "factor_description": "The production of goods from raw materials, such as cement, chemicals, and metals, all emit carbon dioxide.",
                "business_as_usual_text": "As the economy grows, so does the production of goods. Making more and more things result in greater and greater emissions over time.",
                "policy_text": "Manufacturers use less energy to light and heat factories and to run equipment, fuel is switched to cleaner options, and recycled scrap steel and scrap aluminum are used as opposed to smelting new aluminum or forging new steel."
            },
            {   "order_num": 6, 
                "legend_label": "Buildings", 
                "title": "Buildings", 
                "color": "#46d999", 
                "policy": "usual",
                "icon_class": "buildings",
                "factor_description": "Commercial buildings use large amounts of energy for heating, cooling, lighting, and other functions.",
                "business_as_usual_text": "Buildings continue to be built as they are now, which isn’t energy efficient.",
                "policy_text": "Techniques are employed to improve building energy efficiency, including better insulation and more energy-efficient heating, cooling, ventilation, and refrigeration systems."
            },
            {   "order_num": 7, 
                "legend_label": "Houses", 
                "title": "Houses", 
                "color": "#3cd6d8", 
                "policy": "usual",
                "icon_class": "houses",
                "factor_description": "Homes require energy to light, heat, and cool them. Burning natural gas and oil for heating and cooking emits greenhouse gases, mostly carbon dioxide, into the atmosphere. Refrigerators and air conditioners also leak other greenhouse gases into the atmosphere.",
                "business_as_usual_text": "More homes are built to satisfy population growth, and the majority of these homes use energy from fossil fuel production.",
                "policy_text": "Energy efficient homes are widespread. This includes better insulation, replacing incandescent light bulbs with LEDs or fluorescents, and more efficient home appliances. More people choose smaller homes and power their homes with renewable energy like solar panels."
            },
            {   "order_num": 8, 
                "legend_label": "Ships", 
                "title": "Ships", 
                "color": "#60bcfd", 
                "policy": "usual",
                "icon_class": "ships",
                "factor_description": "Although international shipping is the most energy efficient mode of mass transport and only a modest contributor to overall emissions, engines still require fuel that emits carbon dioxide.",
                "business_as_usual_text": "Global trade and production continue to expand, and therefore energy use that emits greenhouse gases remains high.",
                "policy_text": "Ships further improve their energy efficiency and effective emission control is taken. Improved planning for ship travel, such as improving routes using weather forecasts, helps increase fuel efficiency."
            },
            {   "order_num": 9, 
                "legend_label": "Planes", 
                "title": "Planes", 
                "color": "#96a6fb", 
                "policy": "usual",
                "icon_class": "planes",
                "factor_description": "Commercial aircraft burn fuel in order to fly. Planes are less efficient than cars, and the longer the flight is, the more energy it requires.",
                "business_as_usual_text": "Air transportation grows alongside population and the economy.",
                "policy_text": "Practices that minimize fuel use (such as reducing average taxi time and reducing engine-idling) are adopted. New technologies are developed to help engines be more fuel efficient. "
            },
            {   "order_num": 10, 
                "legend_label": "Cars & Trucks", 
                "title": "Cars & Trucks", 
                "color": "#4459c8", 
                "policy": "usual",
                "icon_class": "cars",
                "factor_description": "Cars and trucks burn fossil fuels, which emit carbon dioxide and other pollutants into the air. Bigger vehicles are heavier and less efficient, and thus produce more emissions. Over 90% of the fuel used for transportation is petroleum based, which includes gasoline and diesel.",
                "business_as_usual_text": "As the population and economy grows, we continue to rely on gasoline and diesel fuel for transportation.",
                "policy_text": "Advanced technologies, design, and materials are used to develop more fuel-efficient vehicles.  Alternative and renewable fuels are increasingly used. People also take advantage of public transportation, carpooling, walking, and biking to reduce our overall carbon footprint. "
            }               
        ],
        "historical_data": [
            ["Year", "Temp"],
            [1880,  0.54],
            [1881,  0.648],
            [1882,  0.648],
            [1883,  0.504],
            [1884,  0.396],
            [1885,  0.36],
            [1886,  0.396],
            [1887,  0.306],
            [1888,  0.486],
            [1889,  0.576],
            [1890,  0.18],
            [1891,  0.324],
            [1892,  0.216],
            [1893,  0.198],
            [1894,  0.27],
            [1895,  0.36],
            [1896,  0.612],
            [1897,  0.558],
            [1898,  0.306],
            [1899,  0.558],
            [1900,  0.648],
            [1901,  0.522],
            [1902,  0.324],
            [1903,  0.162],
            [1904,  0.018],
            [1905,  0.252],
            [1906,  0.396],
            [1907,  0.108],
            [1908,  0],
            [1909,  0.018],
            [1910,  0.108],
            [1911,  0],
            [1912,  0.198],
            [1913,  0.216],
            [1914,  0.54],
            [1915,  0.666],
            [1916,  0.27],
            [1917,  0.234],
            [1918,  0.414],
            [1919,  0.414],
            [1920,  0.414],
            [1921,  0.522],
            [1922,  0.378],
            [1923,  0.396],
            [1924,  0.342],
            [1925,  0.522],
            [1926,  0.666],
            [1927,  0.522],
            [1928,  0.468],
            [1929,  0.252],
            [1930,  0.612],
            [1931,  0.648],
            [1932,  0.576],
            [1933,  0.342],
            [1934,  0.594],
            [1935,  0.522],
            [1936,  0.576],
            [1937,  0.738],
            [1938,  0.72],
            [1939,  0.756],
            [1940,  0.936],
            [1941,  1.116],
            [1942,  1.044],
            [1943,  1.044],
            [1944,  1.296],
            [1945,  1.08],
            [1946,  0.756],
            [1947,  0.684],
            [1948,  0.684],
            [1949,  0.666],
            [1950,  0.486],
            [1951,  0.756],
            [1952,  0.81],
            [1953,  0.936],
            [1954,  0.558],
            [1955,  0.522],
            [1956,  0.414],
            [1957,  0.864],
            [1958,  0.972],
            [1959,  0.882],
            [1960,  0.81],
            [1961,  0.9],
            [1962,  0.936],
            [1963,  0.954],
            [1964,  0.504],
            [1965,  0.63],
            [1966,  0.72],
            [1967,  0.738],
            [1968,  0.72],
            [1969,  0.936],
            [1970,  0.828],
            [1971,  0.63],
            [1972,  0.81],
            [1973,  1.062],
            [1974,  0.63],
            [1975,  0.774],
            [1976,  0.63],
            [1977,  1.116],
            [1978,  0.972],
            [1979,  1.17],
            [1980,  1.242],
            [1981,  1.314],
            [1982,  1.098],
            [1983,  1.386],
            [1984,  1.026],
            [1985,  1.008],
            [1986,  1.17],
            [1987,  1.44],
            [1988,  1.44],
            [1989,  1.296],
            [1990,  1.548],
            [1991,  1.494],
            [1992,  1.224],
            [1993,  1.278],
            [1994,  1.368],
            [1995,  1.584],
            [1996,  1.35],
            [1997,  1.692],
            [1998,  1.908],
            [1999,  1.566],
            [2000,  1.53],
            [2001,  1.746],
            [2002,  1.854],
            [2003,  1.872],
            [2004,  1.8],
            [2005,  1.944],
            [2006,  1.872],
            [2007,  1.872],
            [2008,  1.746],
            [2009,  1.908],
            [2010,  2.034],
            [2011,  1.8],
            [2012,  1.89],
            [2013,  1.962],
            [2014,  2.106],
            [2015,  2.394]
        ]
    }
}